## Больше двух чисел

Требуется найти наименьшее целое число, которое строго больше обоих заданных целых чисел.

**Ограничения**  
Время: 2 секунды  
Память 256 мибибайт  

**Формат входных данных:**  
В единственной строке содержатся два целых числа через пробел: $a$ и $b$ $(−10^9 \leq a, b \leq +10^9)$ — числа, для которых требуется найти наименьшее превосходящее их целое число.


**Формат выходных данных:**  
В единственной строке выведите единственное целое число — наименьшее целое число, которое строго больше и $a$, и $b$.

**Пример**
|Входные данные|Выходные данные|
|--------------|---------------|
|2 5           |6
|10 -1         |11             |

**Решение**
```python
a, b = map(int, input().split())
print(max(a, b) + 1)
```

## Автоперестановка

Дана конечная последовательность из n различных целых чисел ${p_k}^n_{k=1}$, каждое из которых может принимать значения от 1 по $n$ включительно, то есть это последовательность ${1, 2,..., n}$, в которой элементы перемешаны некоторым образом. Требуется переставить элементы в этой последовательности таким образом, чтобы получилась последовательность ${a_k}^n_{k=1} = {p_p_k}^n_{k=1}$, в которой на позиции $k$ стоит элемент из исходной последовательности, номер которого в ней равен значению элемента, стоящего в ней на позиции $k$. Здесь подразумевается, что элементы в конечной последовательности имеют номера с 1 по $n$ включительно.

**Ограничения**  
Время: 2 секунды  
Память 256 мибибайт  

**Формат входных данных:**  
В первой строке содержится единственное целое число $n (1 \leq n \leq 10^5)$ — количество элементов в последовательности.  
Во второй строке содержатся $n$ различных целых чисел $p_k$ через пробел $(1 \leq p_k \leq n)$ — соответствующие элементы последовательности.


**Формат выходных данных:**  
Выведите $n$ целых чисел через пробел — элементы исходной последовательности, переставленные местами таким образом, чтобы на позиции с номером $k$ стоял элемент исходной последовательности, который имел в ней номер, равный значению элемента, изначально стоящего в ней на позиции с номером $k$.

**Пример**
|Входные данные      |Выходные данные     |
|--------------------|--------------------|
|5                   |4 3 1 5 2           |
|2 4 5 3 1           |                    |
|--------------------|--------------------|
|10                  |1 2 3 4 5 6 7 8 9 10|
|10 9 8 7 6 5 4 3 2 1|                    |

**Решение**
```python
n = int(input())
nums = list(map(int, input().split()))
poss = [0] * (n + 1)
for i, v in enumerate(nums):
    poss[v] = i

res = [0] * n
for i, v in enumerate(nums):
    res[poss[i+1]] = v

print(*res)
```